In [1]:
import pandas as pd
import numpy as mp
import matplotlib.pyplot as plt
from sklearn import linear_model

In [12]:
df=pd.DataFrame({
    'Area':[2700,3500,4500,4000,2500,3600,45100,6000],
    'bedroom':[2.0,3.0,2.0,'NaN','NaN',3.0,4.0,4.0],
    'bathroom':[1.0,2.0,'NaN',2.0,1.0,2.0,2.0,2.0],
    'balcony':[2.0,'NaN',2.0,1.0,2.0,1.0,'NaN',2.0],
    'price':[550000,560000,600000,570000,300000,650000,450000,700000]
})
df.to_csv('file1.csv')

In [33]:
df=pd.read_csv('/content/file1.csv', index_col=[0])
df

    Area  bedroom  bathroom  balcony   price
0   2700      2.0       1.0      2.0  550000
1   3500      3.0       2.0      NaN  560000
2   4500      2.0       NaN      2.0  600000
3   4000      NaN       2.0      1.0  570000
4   2500      NaN       1.0      2.0  300000
5   3600      3.0       2.0      1.0  650000
6  45100      4.0       2.0      NaN  450000
7   6000      4.0       2.0      2.0  700000

In [34]:
df.bathroom.median()

2.0

In [36]:
df.bathroom=df.bathroom.fillna(df.bathroom.median())
df

    Area  bedroom  bathroom  balcony   price
0   2700      2.0       1.0      2.0  550000
1   3500      3.0       2.0      NaN  560000
2   4500      2.0       2.0      2.0  600000
3   4000      NaN       2.0      1.0  570000
4   2500      NaN       1.0      2.0  300000
5   3600      3.0       2.0      1.0  650000
6  45100      4.0       2.0      NaN  450000
7   6000      4.0       2.0      2.0  700000

In [38]:
df.bedroom=df.bedroom.fillna(df.bedroom.median())

df

    Area  bedroom  bathroom  balcony   price
0   2700      2.0       1.0      2.0  550000
1   3500      3.0       2.0      NaN  560000
2   4500      2.0       2.0      2.0  600000
3   4000      3.0       2.0      1.0  570000
4   2500      3.0       1.0      2.0  300000
5   3600      3.0       2.0      1.0  650000
6  45100      4.0       2.0      NaN  450000
7   6000      4.0       2.0      2.0  700000

In [40]:
df.balcony=df.balcony.fillna(df.balcony.median())
df

    Area  bedroom  bathroom  balcony   price
0   2700      2.0       1.0      2.0  550000
1   3500      3.0       2.0      2.0  560000
2   4500      2.0       2.0      2.0  600000
3   4000      3.0       2.0      1.0  570000
4   2500      3.0       1.0      2.0  300000
5   3600      3.0       2.0      1.0  650000
6  45100      4.0       2.0      2.0  450000
7   6000      4.0       2.0      2.0  700000

In [42]:
x=df.drop('price',axis=1)
y=df.price
print(x)
print(y)

    Area  bedroom  bathroom  balcony
0   2700      2.0       1.0      2.0
1   3500      3.0       2.0      2.0
2   4500      2.0       2.0      2.0
3   4000      3.0       2.0      1.0
4   2500      3.0       1.0      2.0
5   3600      3.0       2.0      1.0
6  45100      4.0       2.0      2.0
7   6000      4.0       2.0      2.0
0    550000
1    560000
2    600000
3    570000
4    300000
5    650000
6    450000
7    700000
Name: price, dtype: int64

In [43]:
reg=linear_model.LinearRegression()
reg.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [45]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(x,y,test_size=0.30,random_state=5)
reg.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [46]:
reg.coef_

array([-2.00e+02,  8.21e+06, -8.04e+06, -1.10e+05])

In [47]:
reg.intercept_

-7069999.999999838

In [48]:
reg.predict([[4100,3,2,1]])

array([550000.])